In [1]:
import numpy as np
import pandas as pd

In [4]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [5]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [6]:
df = pd.DataFrame(arr, index=["Index1", "Index2", "Index3"], columns=["Column1","Column2","Column3"])

In [7]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [8]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [9]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [11]:
df.dropna(axis=1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [12]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [14]:
df.dropna(thresh = 2) #minimum 2 tane nan olmayan sayı olan indexleri silmez

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [15]:
df.dropna(thresh = 3)

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [16]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [17]:
df.fillna(value = 1)

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [19]:
df.fillna(value = 100)

        Column1  Column2  Column3
Index1     10.0     20.0    100.0
Index2      5.0    100.0    100.0
Index3     21.0    100.0     10.0

In [20]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [21]:
df.sum()

Column1    36.0
Column2    20.0
Column3    10.0
dtype: float64

In [22]:
df.sum().sum()

66.0

In [24]:
df.size #veri sayısı

9

In [25]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

In [26]:
df.isnull().sum().sum()

4

In [27]:
def calculateMean(df):
    totalSum = df.sum().sum()
    totalNum = df.size - df.isnull().sum().sum()
    return totalSum/totalNum

In [30]:
df.fillna(value = calculateMean(df), inplace=True)

In [31]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [32]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0